# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-        
# @Time    : 2025/9/9 下午9:38   
# @Author  : 李清水            
# @File    : __init__.py       
# @Description : Piranha LED 驱动包,支持共阳极或共阴极LED控制;
#                可以直接通过:
#                   from piranha_led_driver import PiranhaLED, POLARITY_CATHODE, POLARITY_ANODE
#                导入 LED 类和常量
# @License : CC BY-NC 4.0

# ======================================== 导入相关模块 =========================================

# 从 code/piranha_led.py 导入类和常量
from .code.piranha_led import PiranhaLED, POLARITY_CATHODE, POLARITY_ANODE

# ======================================== 全局变量 ============================================

# 定义对外可访问接口
__all__ = ["PiranhaLED", "POLARITY_CATHODE", "POLARITY_ANODE"]

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================

# ========================================  主程序  ===========================================