# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-        
# @Time    : 2025/9/9 下午11:19   
# @Author  : 缪贵成
# @File    : __init__.py
# @Description : drivers 包初始化，提供统一入口，按需导入子模块。
# @License : CC BY-NC 4.0

# ======================================== 导入相关模块 =========================================

# 显式导出子包或子模块
from . import hall_sensor_oh34n_driver
from . import lm386_speaker_driver
from . import max9814_mic_driver


# ======================================== 全局变量 ============================================

# 定义对外可访问的接口（子模块名称）
__all__ = [
    "hall_sensor_oh34n_driver",
    "lm386_speaker_driver",
    "max9814_mic_driver",

]

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================

# ========================================  主程序  ===========================================