# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-        
# @Time    : 2025/9/9 下午10:08   
# @Author  : 李清水            
# @File    : boot.py       
# @Description : 启动文件示例，启动时点亮板载 LED 1 秒后关闭
# @License : CC BY-NC 4.0

# ======================================== 导入相关模块 =========================================

# 导入硬件相关模块
import time
from machine import Pin

# 导入自定义板级模块
import board

# ======================================== 全局变量 ============================================

# 获取板载 LED 引脚
led_pin = board.get_fixed_pin("LED")

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================

# 初始化 Pin
led = Pin(led_pin, Pin.OUT)

# ========================================  主程序  ===========================================

# 点亮 LED
led.value(1)
# 点亮 1 秒
time.sleep(1)

# 熄灭 LED
led.value(0)

print("boot.py executed: LED flashed for 1 second")