# Python env   : MicroPython v1.23.0
# -*- coding: utf-8 -*-        
# @Time    : 2025/9/9 下午10:26   
# @Author  : 李清水            
# @File    : conf.py       
# @Description : 静态配置与运行时开关配置文件
# @License : CC BY-NC 4.0

# ======================================== 导入相关模块 =========================================

# ======================================== 全局变量 ============================================

# 是否在 boot 或 main 启动时自动开始演示（True: 自动启动）
AUTO_START = True

# 是否输出调试消息到终端
ENABLE_DEBUG = True

# I2C上传感器外设的初始化的重试常量
I2C_INIT_MAX_ATTEMPTS = 3
I2C_INIT_RETRY_DELAY_S = 0.5

# gc垃圾清理阈值（单位是字节）
GC_THRESHOLD_BYTES = 100000
# task_err_callback 在多次发生时的打印间隔（防止刷屏）
ERROR_REPEAT_DELAY_S = 1.0

# ======================================== 功能函数 ============================================

# ======================================== 自定义类 ============================================

# ======================================== 初始化配置 ==========================================

# ========================================  主程序  ===========================================